
def area(a):
    '''
    Принимает число a, возвращает площадь квадрата

        Параметры:
            a (int | float): Число - длина стороны квадрата.

        Возвращаемое значение:
            area (int | float): Число означающее площадь квадрата с входной стороной. 

        Примеры вызова:
            area(2) = 4
            area(3) = 9
            area(3.1) = 9.61

    '''
    return a * a


def perimeter(a):
        '''
    Принимает число a, возвращает периметр квадрата

        Параметры:
            a (int | float): Число - длина стороны квадрата.

        Возвращаемое значение:
            perimeter (int | float): Число означающее периметр квадрата с входной стороной. 

        Примеры вызова:
            perimeter(2) = 8
            perimeter(3) = 12
    '''
    return 4 * a
